docs/notes/emacs-macos-contacts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MacOS Contacts in Emacs</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="description" content="A small startup-file snippet that exposes macOS Contacts inside Emacs through the built-in EUDC framework, with no external packages required, plus a keyboard shortcut for quick lookup." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/main.css" />

<link rel="canonical" href="https://jangid.info/notes/emacs-macos-contacts.html"/>
<meta name="description" content="A small startup-file snippet that exposes macOS Contacts inside Emacs through the built-in EUDC framework, with no external packages required, plus a keyboard shortcut for quick lookup."/>
<meta property="og:type" content="article"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="MacOS Contacts in Emacs"/>
<meta property="og:description" content="A small startup-file snippet that exposes macOS Contacts inside Emacs through the built-in EUDC framework, with no external packages required, plus a keyboard shortcut for quick lookup."/>
<meta property="og:url" content="https://jangid.info/notes/emacs-macos-contacts.html"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="MacOS Contacts in Emacs"/>
<meta name="twitter:description" content="A small startup-file snippet that exposes macOS Contacts inside Emacs through the built-in EUDC framework, with no external packages required, plus a keyboard shortcut for quick lookup."/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<p class="eyebrow"><a href="/notes/tags/tech.html">tech</a></p><h1 class="title">MacOS Contacts in Emacs
<br />
<span class="subtitle">(Note that this requires Emacs 28 or later)</span>
</h1><p class="byline">Published 23 Jan 2021</p>
<p>
Following code in your startup file will enable macOS contacts access
via built-in EUDC feature of Emacs. No need for any extra package for
this. The below snippet will add a keyboard short-cut as well <code>‘C-c
TAB’</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="font-weight: bold;">when</span> (eq system-type 'darwin)
  (<span style="font-weight: bold;">eval-and-compile</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">eudcb-macos-contacts</span>))
  (eudc-macos-contacts-set-server <span style="font-style: italic;">"localhost"</span>))
(<span style="font-weight: bold;">eval-when-compile</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">message</span>))
(define-key message-mode-map
  [(control ?c) (tab)] 'eudc-expand-inline)
(<span style="font-weight: bold;">eval-when-compile</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">sendmail</span>))
(define-key mail-mode-map
  [(control ?c) (tab)] 'eudc-expand-inline)
</code></pre>
</div>

<p>
So if you are in a message buffer address field, just type few
characters to search and then press the above defined key sequence
<code>‘C-c TAB’</code>. If multiple matching contacts are found then the
completion system will come into play. Icomplete also works with it.
</p>

<p>
Another 0.1 sec saved in loading time. <code>‘esup’</code> now shows
1.497sec. Because this is all builtin.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./colors-of-web.html"><span class="label">Newer</span><span class="title">&larr; Colors of Web</span></a><a class="older" href="./increasing-minimum-wage-by-50-percent-isnt-going-to-work.html"><span class="label">Older</span><span class="title">Increasing Minimum Wage By 50% Is Not Going To Work &rarr;</span></a></nav><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
